{
	"name" : "The Great Expansion",
	"description" : "This mod adds: \n\n• 94 new artifacts\n\n• 19 new heroes\n\n• 26 new secondary skills\n\n• 7 new map objects\n\n• 4 new spells\n\n\n\nThe mod also changes some of the game configs:\n\n• Creatures can equip creature artifacts\n\n\n\nList of added artifacts:\n\nCape\n\nCape of Disguise (Minor): The hero's army is permanently affected by a basic Disguise spell.\n\nCape of Mists (Major): Enemy ranged creatures suffer a penalty of -1 to Speed and -25% to ranged damage dealt.\n\nMantle of Spell Deflection (Relic): The hero's army has 20% chance to deflect a harmful spell to a random enemy unit.\n\nShiver Cloak (Treasure): Increases the hero's Knowledge by 1 and reduces Speed of all units on the battlefield by 1.\n\nWizard Robe (Minor): Allows the hero to cast all level 1 spells.\n\n\n\nCombo\n\nExplorer’s Hat (Major): Adds a small bonus to Movement Points on land. (Builds out of Centaur Ae, Shield of the Dwarven Lords, Helm of the Alabaster Unicorn and Breastplate of Petrified Wood, granting the components’ +2 to Attack, +2 to Defense, +1 to Spellpower and +1 to Knowledge).\n\nOrb of Chaos (Relic): Further increases all spell damage dealt by 30%. (Builds out of Orb of the Firmament, Orb of Silt, Orb of Tempestous Fire and Orb of Driving Rain, effectively increasing spell damage by 50%).\n\nReign of the Swamp King (Relic): Each unit in the hero's army has a 3% chance (per creature in stack) to kill one enemy creature. (Builds out of Greater Gnoll’s Flail, Buckler of the Gnoll King, Helm of Chaos and Scales of the Greater Basilisk, granting the components’ +4 to Attack, +4 to Defense, +3 to Spellpower and +3 to Knowledge).\n\nTome of Omniscience (Relic): Allows you to cast all spells on Expert level. (Builds out of Tome of Air Magic, Tome of Earth Magic, Tome of Fire Magic and Tome of Water Magic, granting the component’s ability to cast all spells).\n\nWailing Inferno (Relic): Each creature in the enemy hero's army has its Max Health reduced by 2. (Builds out of Sword of Hellfire, Shield of the Damned, Hellstorm Helmet and Breastplate of Brimstone, granting the components’ +6 to Attack, +6 to Defense, +5 to Spellpower, +5 to Knowledge).\n\n\n\nCreature\n\nBehemoth Claw (Major): Stack equipped with this artifact has a bonus of +5 to Attack and Defense and ignores 50% of enemy's Defense when attacking.\n\nBlood Ruby (Treasure): Stack equipped with this artifact has a bonus of +4 to Max Health.\n\nCelestial Boon (Minor): Stack equipped with this artifact can be target of friendly spells even if it has Magic Immunity.\n\nChampion Crown (Relic): Stack equipped with this artifact has its Max Health increased by 6 and its Damage increased by 1-3.\n\nCrimson Scarf (Treasure): Stack equipped with this artifact deals 40% more damage with attacks, but also receives 30% more damage from all attacks.\n\nDragon Scale (Major): Stack equipped with this artifact is immune to all spells.\n\nFaerie Dust (Minor): Stack equipped with this artifact removes buffs from all attacked units and has a 20% chance to cast Expert Blind on the target.\n\nFortification Rune (Minor): Stack equipped with this artifact has a bonus of +7 to Attack and +7 to Defense, but suffers a penalty of -1 to Speed.\n\nFright Talisman (Minor): Stack equipped with this artifact prevent enemy retaliation.\n\nGem of Calamity (Major): Stack equipped with this artifact has a bonus of +100% to Max Damage.\n\nGolden Medal (Major): Stack equipped with this artifact has a bonus of +1 to Attack, +1 to Defense, +4 to Max Health and +2 to Speed.\n\nGrandmaster’s Seal (Relic): Stack equipped with this artifact has a bonus of +1 to Attack, +1 to Defense, +3 to Max Health, +2 to Damage and +2 to Speed.\n\nHydra Blood (Major): Stack equipped with this artifact has a bonus of +3 to Max Health, an additional 20% to Max Health and Regenerates 75 Health per turn.\n\nInitiate Badge (Treasure): Stack equipped with this artifact has a bonus of +1 to Attack, +1 to Defense and +2 to Speed.\n\nMaster’s Seal (Major): Stack equipped with this artifact has a bonus of +1 to Attack, +1 to Defense, +3 to Max Health, +1 to Max Damage and +2 to Speed.\n\nMinor Attack Rune (Treasure): Stack equipped with this artifact has a bonus of +7 to Attack.\n\nMinor Defense Rune (Treasure): Stack equipped with this artifact has a bonus of +7 to Defense.\n\nPlague Censer (Minor): Stack equipped with this artifact has a bonus of +4 to Max Health and has a 20% chance to cast Disease on the target.\n\nRune of Air Immunity (Minor): Stack equipped with this artifact is immune to all air spells.\n\nRune of Dragon Strength (Relic): Stack equipped with this artifact has a bonus of +100% to Damage and Max Health, rounded down. Doesn't work on Dragons.\n\nRune of Earth Immunity (Minor): Stack equipped with this artifact is immune to all earth spells.\n\nRune of Fire Immunity (Minor): Stack equipped with this artifact is immune to all fire spells.\n\nRune of Giant Strength (Minor): Stack equipped with this artifact has a bonus of +25% to Damage and Max Health, rounded down.\n\nRune of Indomitable Champion (Relic): Stack equipped with this artifact has Unlimited Retaliation and regenerates 75 Health at the start of each of its turns.\n\nRune of Water Immunity (Minor): Stack equipped with this artifact is immune to all water spells.\n\nSilver Medal (Minor): Stack equipped with this artifact has a bonus of +1 to Attack, +1 to Defense, +1 to Max Health and +2 to Speed.\n\nSniper’s Eyepatch (Major): Stack equipped with this artifact has a bonus of +30% to ranged damage dealt and ignores any range penalty it would have.\n\nTiger Helmet (Major): Stack equipped with this artifact gains 5 Defense, 1 Max Damage and gains First Strike.\n\nUnicorn Horn (Major): Stack equipped with this artifact has a bonus of +2 to Max Health, +1 to Speed, gains 20% Spell Resistance and has a 20% chance to cast Expert Blind on the target.\n\nVampire Fang (Major): Stack equipped with this artifact becomes Undead, gains 2 Speed and heals for 30% of any damage dealt. This effect can revive dead units in the stack.\n\nWand of Curses (Treasure): Stack equipped with this artifact has a 30% chance to apply an advanced Curse on attack.\n\nWolf Fang (Minor): Stack equipped with this artifact has its Damage increased by 1.\n\nWyvern Fang (Major): Stack equipped with this artifact has its Damage increased by 1-2 and has a 20% chance to inflict Poison.\n\n\n\nFeet\n\nBoots of Haste (Minor): Increases the Speed of units in your army by 1.\n\nCrocodile Boots (Treasure): Increases the amount of Movement Points on land by 175.\n\nExplorer’s Boots (Major): Increases the amount of Movement Points on land by 300 and increases Sight Radius by 1.\n\nPlaneswalker’s Boots (Relic): Allows you to cast Visions, View Air, Disguise, Dimension Door, Fly, View Earth, Town Portal, Summon Boat, Scuttle Boat and Water Walk at Expert level.\n\nWanderer’s Boots (Relic): Increases the amount of Movement Points on land and sea by 600.\n\nWinged Sandals (Major): Increases all primary attributes of the hero by 1 and increases Speed of units in the hero's army by 1.\n\n\n\nHelmet\n\nCirclet of Wisdom (Treasure): Increases Knowledge by 1 and daily Mana Regeneration by 2.\n\nCrown of Command (Major): Increases Morale of units in the hero's army by 2 and their Speed by 1.\n\nHelm of Leadership (Major): Increases Attack, Knowledge and Morale of the hero by 2.\n\nHelm of Power (Minor): Increases Knowledge by 2 and daily Mana Regeneration by 4.\n\nSpellbinder (Major): Increases Spell Power and Knowledge by 25%.\n\nWelding Mask (Minor): Grants an additional shot to controlled Ballista and Catapult.\n\n\n\nMisc\n\nOutworld Obsidian (Relic): Reduces enemy's Morale and Luck by 3.\n\nTomb Relic (Minor): Increases Attack and Defense of the hero by 3, but reduces Morale by 1.\n\nWarlock’s Skull (Minor): Increases Spellpower and Knowledge of the hero by 3, but reduces Morale by 1.\n\n\n\nNecklace\n\nAnkh of Life (Minor): Increases Max Health of units in the hero's army by 10% and increases effectiveness of Animate Dead, Cure and Resurrection spells by 10%.\n\nNecklace of the Muses (Major): Beneficial spells you cast ignore Magic Immunity of friendly units.\n\nOrder of Recognition (Minor): Increases the chance a neutral stack will join the hero's army.\n\nProphetic Gift (Relic): Increases effective spell school level of all magic schools by 1 and increases Sight Radius by 5.\n\nScarab of Fortitude (Relic): Reduces damage received by your army from physical attacks by 40%.\n\nSparkling Necklace of Charming (Major): Greatly increases the chance a neutral stack will join the hero's army.\n\n\n\nRing\n\nArboreal Ring (Relic): Grants the wielder 750 Gold per day and increases weekly creature growth in all controlled towns by 40%.\n\nDwarven Ring (Minor): Increases Attack and Defense of the hero by 2, but reduces the army's Speed by 1.\n\nRing of Annulment (Relic): Enemy spells are cast at no proficiency.\n\nRing of Banes (Minor): Increases effectiveness of some spells: Curse reduces the target's Damage by an additional 1. Weakness reduces Attack by an additional 1. Slow reduces Speed by an additional 1. Disrupting Ray reduces Defense by an additional 1.\n\nRing of Boons (Minor): Increases effectiveness of some spells: Bless increases the target's Damage by an additional 1. Bloodlust increases Attack by an additional 1. Haste increases Speed by an additional 1. Stone Skin increases Defense by an additional 1.\n\nRing of Elements (Relic): Doubles the amount of elementals summoned through Summon Air Elemental, Summon Earth Elemental, Summon Fire Elemental and Summon Water Elemental spells.\n\nRing of Giant Strength (Major): Increases Damage and Health of all units in the hero's army by 25%, rounded down.\n\nRing of Protection (Treasure): Reduces damage received from all attacks by units in the hero's army by 8%.\n\nRing of Strength (Treasure): Renders all units in the hero's army immune to Weakness and Disrupting Ray spells.\n\nRing of the Journeyman (Major): Allows the hero to cast all level 2 spells.\n\nRing of the Vampire King (Relic): Reduces Max Health of units in the hero's army by 30%, but grants them a 40% Vampiric Attack and turns all your units Undead.\n\nSorcerer’s Ring (Minor): Increases damage dealt with spells by 20%.\n\nSoulscar Ring (Treasure): Increases all of the hero's primary skills by 1, but reduces Luck by 1.\n\nWarrior Ring (Treasure): Increases damage dealt by melee units in the hero's army by 10%.\n\n\n\nShield\n\nBerserker Axe (Treasure): Increases Attack of the hero by 3, but reduces Defense by 1.\n\nCrescent Dagger (Minor): Increases Attack of the hero by 5.\n\nCrystal Shield (Major): Increases the hero's Defense by 6 and Max Health of units in the hero's army by 3.\n\nShield of Retribution (Relic): Increases Attack and Defense of the hero by 4 and grants an additional retaliation strike to creatures in the hero's army.\n\n\n\nTorso\n\nBreastplate of Regeneration (Major): Increases the hero's Defense by 6 and causes units in the hero's army to regenerate 75 Health at the start of their turns.\n\nElvish Chainmail (Minor): Increases the hero's Defense by 2 and grants the army immunity to Slow.\n\nHarmonic Chainmail (Relic): Increases the hero's Defense by 8 and grants a bonus of +3 to Morale and Luck.\n\nKnight Mail (Treasure): Increases Defense and Morale of the hero by 1.\n\nPrimal Champion’s Armor (Relic): Increases the hero's Defense by 3 and the army's Damage by 1.\n\nTiger Armor (Relic): Increases the army's Damage by 2.\n\n\n\nWeapon\n\nCrusader’s Mace (Major): Increases the hero's Attack and Defense by 3 and the army's Max Damage by 1.\n\nEldritch Wand (Major): Increases damage dealt by the Magic Arrow spell by 100%.\n\nInfernal Staff (Major): Increases the hero's Spellpower by 4 and reduces Speed of enemy units by 1.\n\nKnight Sword (Treasure): Increases Attack and Morale of the hero by 1.\n\nSwiftguard Halberd (Relic): Increases the army's Damage, Health and Speed by 1.\n\n\n\n\n\nList of added heroes:\n\nCastle\n\nKaite (Knight)\n\nArmy: Pikeman (10-20), Pikeman (10-20), Pikeman (10-20)\n\nSkills: Inspiration (Basic), Leadership (Basic)\n\nSpells: None\n\nSpecialization: Pikemen and Halberdiers in the hero's army receive a bonus of +1 to their Speed and Damage.\n\nMaurice (Cleric)\n\nArmy: Pikeman (10-20), Archer (4-7), Griffin (4-5)\n\nSkills: Benevolence (Basic), Wisdom (Basic) \n\nSpells: None\n\nSpecialization: Casts Haste with effect increased by 3 for level 1–4 creatures, by 2 for level 5–6 creatures, and by 1 for level 7 creatures.\n\nRampart\n\nWillis (Ranger)\n\nArmy: Centaur (12-24), Dwarf (5-7), Wood Elf (2-4)\n\nSkills: Resistance (Basic), Swiftness (Basic) \n\nSpells: None\n\nSpecialization: Units in the hero's army receive a bonus of +2 to Attack and Speed during the first round of combat.\n\nJevanne (Druid)\n\nArmy: Centaur (10-15), Dendroid Guard (2), Dendroid Guard (2)\n\nSkills: Champion Training (Basic), Mysticism (Basic) \n\nSpells: Ice Bolt\n\nSpecialization: Dendroid Guards and Dendroid Soldiers gain a bonus of +3 to Speed, but also gain a penalty of -3 to Defense.\n\n\n\n\n\nList of added map objects:\n\nCreature Banks\n\nArcane Tower:\n\n[30%] Guardians: 9xMage, 8xArchmage, 5xMonk, 4xZealot; Reward: 1000 XP and 2xEnchanter\n\n[30%] Guardians: 13xMage, 11xArchmage, 7xMonk, 5xZealot; Reward: 1000 XP and 3xEnchanter\n\n[30%] Guardians: 17xMage, 14xArchmage, 9xMonk, 6xZealot; Reward: 1000 XP and 4xEnchanter\n\n[10%] Guardians: 21xMage, 17xArchmage, 11xMonk, 7xZealot; Reward: 1000 XP and 5xEnchanter\n\nDruids’ Cave:\n\n[30%] Guardians: 56xPegasus, 20xDendroid Guard, 14xSilver Pegasus, 4xDendroid Soldier; Reward: +1 to Primary Skills, 8750 Gold\n\n[30%] Guardians: 56xPegasus, 25xDendroid Guard, 21xSilver Pegasus, 8xDendroid Soldier; Reward: +1 to Primary Skills, 8750 Gold, 1xMinor Artifact\n\n[30%] Guardians: 56xPegasus, 25xDendroid Guard, 28xSilver Pegasus, 12xDendroid Soldier; Reward: +1 to Primary Skills, 10000 Gold, 1xMajor Artifact\n\n[10%] Guardians: 56xPegasus, 30xDendroid Guard, 42xSilver Pegasus, 21xDendroid Soldier; Reward: +1 to Primary Skills, 12500 Gold, 1xMinor Artifact, 1xMajor Artifact\n\nHunter’s Cabin:\n\n[30%] Guardians: 24xArcher, 20xMarksman, 11xWood Elf, 9xGrand Elf; Reward: 4xSharpshooter\n\n[30%] Guardians: 31xArcher, 24xMarksman, 14xWood Elf, 11xGrand Elf; Reward: 5xSharpshooter\n\n[30%] Guardians: 38xArcher, 28xMarksman, 17xWood Elf, 13xGrand Elf; Reward: 6xSharpshooter\n\n[30%] Guardians: 45xArcher, 32xMarksman, 20xWood Elf, 15xGrand Elf; Reward: 7xSharpshooter\n\nKing’s Mausoleum:\n\n[30%] Guardians: 56xSwordsman, 20xMonk, 14xCrusader, 4xZealot; Reward: 7500 Gold, 1xTreasure, 1xMinor Artifact, 1xMajor Artifact\n\n[30%] Guardians: 56xSwordsman, 25xMonk, 21xCrusader, 8xZealot; Reward: 10000 Gold, 2xMinor Artifact, 1xMajor Artifact\n\n[30%] Guardians: 56xSwordsman, 25xMonk, 28xCrusader, 12xZealot; Reward: 11000 Gold, 1xTreasure, 2xMinor Artifact, 1xMajor Artifact\n\n[10%] Guardians: 56xSwordsman, 30xMonk, 42xCrusader, 21xZealot; Reward:15000 Gold, 3xMajor Artifact\n\n\n\nTreasures\n\nTreasure Pile: \n\nVariant 1: +4 Rare Resource OR 1500 XP (33%); +3 Rare Resource OR 1000 XP (32%); +2 Rare Resource OR 500 XP (30%); 1xTreasure (5%)\n\nVariant 2: +8 Common Resource OR 1500 XP (33%); +6 Common Resource OR 1000 XP (32%); +4 Common Resource OR 500 XP (30%); 1xTreasure (5%)\n\nMiscellaneous\n\nTribal Totem: Grants +1 Max Health and +10% Max Health for the next battle, also grants 400 Movement Points.\n\n\n\n\n\nList of added secondary skills:\n\nArcana:\n\nBasic: Increases the hero's effective spell power during combat by 7.5%.\n\nAdvanced: Increases the hero's effective spell power during combat by 15%.\n\nExpert: Increases the hero's effective spell power during combat by 22.5%.\n\nBattle Fury:\n\nBasic: Increases Damage of all tier 3+ units under the hero's control by 0-1.\n\nAdvanced: Increases Damage of all tier 3+ units under the hero's control by 1.\n\nExpert: Increases Damage of all tier 3+ units under the hero's control by 1-2.\n\nBenevolence: \n\nBasic: Increases effectiveness of some spells: Bless increases the target's Damage by an additional 1. Bloodlust increases Attack by an additional 1. Haste increases Speed by an additional 1. Stone Skin increases Defense by an additional 1.\n\nAdvanced: Increases effectiveness of some spells: Bless increases the target's Damage by an additional 2. Bloodlust increases Attack by an additional 2. Haste increases Speed by an additional 2. Stone Skin increases Defense by an additional 2.\n\nExpert: Increases effectiveness of some spells: Bless increases the target's Damage by an additional 3. Bloodlust increases Attack by an additional 3. Haste increases Speed by an additional 3. Stone Skin increases Defense by an additional 3.\n\nBlade Bane:\n\nBasic: Units in the hero's army ignore 7.5% of enemy's Attack.\n\nAdvanced: Units in the hero's army ignore 15% of enemy's Attack.\n\nExpert: Units in the hero's army ignore 22.5% of enemy's Attack.\n\nChampion Training:\n\nBasic: Empowers your tier 5-7 units, increasing their damage dealt by 6% and reducing their damage received by 5%.\n\nAdvanced: Empowers your tier 5-7 units, increasing their damage dealt by 12% and reducing their damage received by 10%.\n\nExpert: Empowers your tier 5-7 units, increasing their damage dealt by 18% and reducing their damage received by 15%.\n\nChanneling:\n\nBasic: Reduces the mana cost of spells cast by the hero by 1. Doesn't stack with other manacost-reducing abilities.\n\nAdvanced: Reduces the mana cost of spells cast by the hero by 2. Doesn't stack with other manacost-reducing abilities.\n\nExpert: Reduces the mana cost of spells cast by the hero by 3. Doesn't stack with other manacost-reducing abilities.\n\nDefender:\n\nBasic: Increased Defense gained from Defensive Stance by 5.\n\nAdvanced: Increased Defense gained from Defensive Stance by 10.\n\nExpert: Increased Defense gained from Defensive Stance by 15.\n\nElectromancy:\n\nBasic: Blasts all enemies with a weak lightning at the start of each combat (deals 8*Spellpower damage).\n\nAdvanced: Blasts all enemies with a medium lightning at the start of each combat (deals 100+8*Spellpower damage).\n\nExpert: Blasts all enemies with a strong lightning at the start of each combat (deals 200+8*Spellpower damage).\n\nElite Training:\n\nBasic: Empowers your tier 2-4 units, increasing their damage dealt by 6% and reducing their damage received by 5%.\n\nAdvanced: Empowers your tier 2-4 units, increasing their damage dealt by 12% and reducing their damage received by 10%.\n\nExpert: Empowers your tier 2-4 units, increasing their damage dealt by 18% and reducing their damage received by 15%.\n\nEnchant Weapons:\n\nBasic: Units in the hero's army ignore 7.5% of enemy's Defense.\n\nAdvanced: Units in the hero's army ignore 15% of enemy's Defense.\n\nExpert: Units in the hero's army ignore 22.5% of enemy's Defense.\n\nEvasion:\n\nBasic: Reduces damage received by the hero's army from ranged attacks by 10%.\n\nAdvanced: Reduces damage received by the hero's army from ranged attacks by 20%.\n\nExpert: Reduces damage received by the hero's army from ranged attacks by 30%.\n\nGathering:\n\nBasic: Generates 1 Wood per day.\n\nAdvanced: Generates 1 Wood and Ore per day.\n\nExpert: Generates 2 Wood and Ore per day.\n\nInfantry Commander:\n\nBasic: Increases damage dealt by non-flying, non-shooting units in your army by 5% and reduces damage they receive by 5%.\n\nAdvanced: Increases damage dealt by non-flying, non-shooting units in your army by 10% and reduces damage they receive by 10%.\n\nExpert: Increases damage dealt by non-flying, non-shooting units in your army by 15% and reduces damage they receive by 15%.\n\nInfliction:\n\nBasic: Increases duration of the hero's spells by 2 turns.\n\nAdvanced: Increases duration of the hero's spells by 3 turns.\n\nExpert: Increases duration of the hero's spells by 5 turns.\n\nInspiration:\n\nBasic: Empowers your tier 1 units, increasing their damage dealt by 6% and increasing their Speed by 1.\n\nAdvanced: Empowers your tier 1 units, increasing their damage dealt by 13% and increasing their Speed by 2.\n\nExpert: Empowers your tier 1 units, increasing their damage dealt by 20% and increasing their Speed by 3.\n\nIrresistible Magic:\n\nBasic: Reduces Incoming Spell Damage Reduction from enemy units by 6% and reduces their Magic Resistance by 6%. Negative Incoming Spell Damage Reduction causes enemies to receive more damage from spells.\n\nAdvanced: Reduces Incoming Spell Damage Reduction from enemy units by 12% and reduces their Magic Resistance by 12%. Negative Incoming Spell Damage Reduction causes enemies to receive more damage from spells.\n\nExpert: Reduces Incoming Spell Damage Reduction from enemy units by 18%, reduces their Magic Resistance by 18% and reduces their Magic Immunity Level Threshold by 1. Negative Incoming Spell Damage Reduction causes enemies to receive more damage from spells.\n\nMana Reserves:\n\nBasic: Grants 5 Mana at the start of each battle. Any unspent mana gained this way is lost when the combat ends.\n\nAdvanced: Grants 10 Mana at the start of each battle. Any unspent mana gained this way is lost when the combat ends.\n\nExpert: Grants 15 Mana at the start of each battle. Any unspent mana gained this way is lost when the combat ends.\n\nMentor:\n\nBasic: At the start of combat, summons a small stack of Enchanters, depending on the hero's Spellpower.\n\nAdvanced: At the start of combat, summons a medium stack of Enchanters, depending on the hero's Spellpower.\n\nExpert: At the start of combat, summons a large stack of Enchanters, depending on the hero's Spellpower.\n\nMind Magic:\n\nBasic: Frenzy's Defense to Attack bonus increased by 15%. Hypnotize's threshold is increased by 10%.\n\nAdvanced: Frenzy's Defense to Attack bonus increased by 30%. Hypnotize's threshold is increased by 20%.\n\nExpert: Frenzy's Defense to Attack bonus increased by 45%. Hypnotize's threshold is increased by 30%. Mirth and Sorrow Morale modifier increased by 1.\n\nOccultism:\n\nBasic: Increases effectiveness of some spells: Curse reduces the target's Damage by an additional 1. Weakness reduces Attack by an additional 1. Slow reduces Speed by an additional 1. Disrupting Ray reduces Defense by an additional 1.\n\nAdvanced: Increases effectiveness of some spells: Curse reduces the target's Damage by an additional 2. Weakness reduces Attack by an additional 2. Slow reduces Speed by an additional 2. Disrupting Ray reduces Defense by an additional 2.\n\nExpert: Increases effectiveness of some spells: Curse reduces the target's Damage by an additional 3. Weakness reduces Attack by an additional 3. Slow reduces Speed by an additional 3. Disrupting Ray reduces Defense by an additional 3.\n\nReinforcements:\n\nBasic: Increases weekly growth of tier 1 creatures in all owned towns by 2.\n\nAdvanced: Increases weekly growth of tier 1 and 2 creatures in all owned towns by 2 and 1 respectively.\n\nExpert: Increases weekly growth of tier 1,2 and 3 creatures in all owned towns by 2, 1 and 1 respectively.\n\nSky Master:\n\nBasic: Increases Speed of flying units in the hero's army by 1.\n\nAdvanced: Increases Speed of flying units in the hero's army by 2.\n\nExpert: Increases Speed of flying units in the hero's army by 3.\n\nStormwind:\n\nBasic: Reduces Speed of enemy flying units in the hero's army by 1.\n\nAdvanced: Reduces Speed of enemy flying units in the hero's army by 2.\n\nExpert: Reduces Speed of enemy flying units in the hero's army by 3.\n\nSuppression:\n\nBasic: Increases the mana cost of spells cast by the enemy hero by 1. Doesn't stack with other manacost-increasing abilities.\n\nAdvanced: Increases the mana cost of spells cast by the enemy hero by 2. Doesn't stack with other manacost-increasing abilities.\n\nExpert: Increases the mana cost of spells cast by the enemy hero by 3. Doesn't stack with other manacost-increasing abilities.\n\nSwiftness:\n\nBasic: Increases Speed of units of tiers 1-2 in the hero's army by 1.\n\nAdvanced: Increases Speed of all units in the hero's army by 1 and speed of tier 1 units by an additional 1.\n\nExpert: Increases Speed of all units in the hero's army by 1 and speed of tier 1-5 units by an additional 1.\n\nVitality:\n\nBasic: Increases Max Health of all units under the hero's control by 1.\n\nAdvanced: Increases Max Health of all units under the hero's control by 2.\n\nExpert: Increases Max Health of all units under the hero's control by 3.\n\n\n\n\n\n\n\nList of added spells:\n\nEmpower (Level 2 Fire, 11 Mana):\n\nNone: Increases Max Damage of the target stack by 1+25%.\n\nBasic: Increases Max Damage of the target stack by 1+25%.\n\nAdvanced: Increases Max Damage of the target stack by 1+50%.\n\nExpert: Increases Max Damage of all friendly stacks by 1+50%.\n\nLightning Storm (Level 5 Air, 28 Mana): \n\nNone: Deals 25*Spellpower Air Damage to all enemies in a radius 2 area.\n\nBasic: Deals 25*Spellpower Air Damage to all enemies in a radius 2 area.\n\nAdvanced: Deals 30+25*Spellpower Air Damage to all enemies in a radius 2 area.\n\nExpert: Deals 100+25*Spellpower Air Damage to all enemies in a radius 2 area.\n\nRegeneration (Level 2 Water, 8 Mana): \n\nNone: The selected unit will heal 40 Health at the start of each of its turns.\n\nBasic: The selected unit will heal 40 Health at the start of each of its turns.\n\nAdvanced: The selected unit will heal 70 Health at the start of each of its turns.\n\nExpert: All friendly units will heal 100 Health at the start of each of their turns.\n\nWither (Level 4 Fire, 16 Mana): \n\nNone: Reduces Attack and Defense of the chosen stack by 2 and its Speed by 20%.\n\nBasic: Reduces Attack and Defense of the chosen stack by 2 and its Speed by 20%.\n\nAdvanced: Reduces Attack and Defense of the chosen stack by 4 and its Speed by 35%.\n\nExpert: Reduces Attack and Defense of all enemy stacks by 4 and its Speed by 35%.",
	"modType" : "Expansion",
	"author" : "Nathill; Assets are from: Heroes of Might and Magic II, Heroes of Might and Magic IV, Heroes of Might and Magic V, Epic War IV, Towers Tactics: Aphelion, Warcraft III",
	"contact" : "",
	"version" : "0.2.1",
	"changelog" : {
		"0.2.1" : [
			"Added Polish translation",
			"Removed all gameConfig settings changes except of activating creature artifacts",
			"Fixed description of Gram's specialty, it now reads properly that it reduces damage received rather than increases damage dealt."
		],
		"0.2.0" : [
			"Added 16 new hero: Willis (Ranger), Qlinn (Alchemist), Davin (Wizard), Naubb (Demoniac), Zebeth (Heretic), Shavi (Deathknight), Sildd (Necromancer), Scarla (Overlord), Neirith (Warlock), Koruga (Barbarian), Amani (Battlemage), Gram (Beastmaster), Forbest (Witch), Aery (Planeswalker), Tempestus (Planeswalker), Silis (Elementalist)",
			"Reduced Electromancy damage from 0/100/200 + 8xSPP to 0/35/75 + 3xSPP",
			"Added 1 new skill: Irresistible Magic",
			"Added 3 new artifacts: Arboreal Ring, Outworld Obsidian, Ring of the Journeyman",
			"Added 3 new creature banks, 2 new pickable objects and 1 revisitable object",
			"Changed icons of some skills and artifacts, fixed backgrounds of some skills",
			"Fixed some bugs with spells targeting location instead of creature",
			"Removed some unnecessary files"
		],
		"0.1" : [
			"Created"
		]
	},
	"polish" : {
		"name" : "Wspaniałe rozszerzenie",
		"description" : "Ten mod dodaje:\n\n• 94 nowe artefakty\n\n• 19 nowych bohaterów\n\n• 26 nowych umiejętności drugorzędnych\n\n• 7 obiektów mapy przygody\n\n• 4 zaklęcia\n\n\n\nPonadto ten mod zmienia pewne ustawienia gry:\n\n• Jednostki mogą używać artefaktów.",
		"translations" : [
			"translation/polish/artifacts.json",
			"translation/polish/heroes.json",
			"translation/polish/mapObjects.json",
			"translation/polish/secondarySkills.json",
			"translation/polish/spells.json"
		]
	},
	"artifacts" : [
		"config/artifacts/ankhOfLife",
		"config/artifacts/arborealRing",
		"config/artifacts/behemothClaw",
		"config/artifacts/berserkerAxe",
		"config/artifacts/bloodRuby",
		"config/artifacts/bootsOfHaste",
		"config/artifacts/breastplateOfRegeneration",
		"config/artifacts/capeOfDisguise",
		"config/artifacts/capeOfMists",
		"config/artifacts/celestialBoon",
		"config/artifacts/championCrown",
		"config/artifacts/circletOfWisdom",
		"config/artifacts/crescentDagger",
		"config/artifacts/crimsonScarf",
		"config/artifacts/crocodileBoots",
		"config/artifacts/crownOfCommand",
		"config/artifacts/crusadersMace",
		"config/artifacts/crystalShield",
		"config/artifacts/dragonScale",
		"config/artifacts/dwarvenRing",
		"config/artifacts/eldritchWand",
		"config/artifacts/elvishChainmail",
		"config/artifacts/explorersHat",
		"config/artifacts/explorerBoots",
		"config/artifacts/faerieDust",
		"config/artifacts/fortificationRune",
		"config/artifacts/frightTalisman",
		"config/artifacts/gemOfCalamity",
		"config/artifacts/goldenMedal",
		"config/artifacts/grandmasterSeal",
		"config/artifacts/harmonicChainmail",
		"config/artifacts/helmOfLeadership",
		"config/artifacts/helmOfPower",
		"config/artifacts/hydraBlood",
		"config/artifacts/infernalStaff",
		"config/artifacts/initiateBadge",
		"config/artifacts/initiateRing",
		"config/artifacts/knightMail",
		"config/artifacts/knightSword",
		"config/artifacts/mantleOfSpellDeflection",
		"config/artifacts/masterSeal",
		"config/artifacts/minorAttackRune",
		"config/artifacts/minorDefenseRune",
		"config/artifacts/necklaceOfTheMuses",
		"config/artifacts/orbOfChaos",
		"config/artifacts/orderOfRecognition",
		"config/artifacts/outworldObsidian",
		"config/artifacts/plagueCenser",
		"config/artifacts/planeswalkerBoots",
		"config/artifacts/primalChampionArmor",
		"config/artifacts/propheticGift",
		"config/artifacts/reignOfTheSwampKing",
		"config/artifacts/ringOfAnnulment",
		"config/artifacts/ringOfBanes",
		"config/artifacts/ringOfBoons",
		"config/artifacts/ringOfElements",
		"config/artifacts/ringOfGiantStrength",
		"config/artifacts/ringOfProtection",
		"config/artifacts/ringOfStrength",
		"config/artifacts/ringOfTheJourneyman",
		"config/artifacts/ringOfTheVampireKing",
		"config/artifacts/runeOfAirImmunity",
		"config/artifacts/runeOfDragonStrength",
		"config/artifacts/runeOfEarthImmunity",
		"config/artifacts/runeOfFireImmunity",
		"config/artifacts/runeOfGiantStrength",
		"config/artifacts/runeOfIndomitableChampion",
		"config/artifacts/runeOfWaterImmunity",
		"config/artifacts/scarabOfFortitude",
		"config/artifacts/shieldOfRetribution",
		"config/artifacts/shiverCloak",
		"config/artifacts/silverMedal",
		"config/artifacts/sniperEyepatch",
		"config/artifacts/sorcerersRing",
		"config/artifacts/soulscarRing",
		"config/artifacts/sparklingNecklaceOfCharming",
		"config/artifacts/spellBinder",
		"config/artifacts/swiftguardHalberd",
		"config/artifacts/tigerArmor",
		"config/artifacts/tigerHelmet",
		"config/artifacts/tombRelic",
		"config/artifacts/tomeOfOmniscience",
		"config/artifacts/unicornHorn",
		"config/artifacts/vampireFang",
		"config/artifacts/wailingInferno",
		"config/artifacts/wandOfCurses",
		"config/artifacts/wandererBoots",
		"config/artifacts/warlocksSkull",
		"config/artifacts/warriorRing",
		"config/artifacts/weldingMask",
		"config/artifacts/wingedSandals",
		"config/artifacts/wizardRobe",
		"config/artifacts/wolfFang",
		"config/artifacts/wyvernFang"
	],
	"heroClasses" : [
		"config/skills/secondarySkillChances"
	],
	"heroes" : [
		"config/heroes/castle/kaite",
		"config/heroes/castle/maurice",
		"config/heroes/rampart/willis",
		"config/heroes/rampart/jevanne",
		"config/heroes/tower/qlinn",
		"config/heroes/tower/davin",
		"config/heroes/inferno/naubb",
		"config/heroes/inferno/zebeth",
		"config/heroes/necropolis/shavi",
		"config/heroes/necropolis/sildd",
		"config/heroes/dungeon/scarla",
		"config/heroes/dungeon/neirith",
		"config/heroes/stronghold/koruga",
		"config/heroes/stronghold/amani",
		"config/heroes/fortress/gram",
		"config/heroes/fortress/forbest",
		"config/heroes/conflux/silis",
		"config/heroes/conflux/tempestus",
		"config/heroes/conflux/aery"
	],
	"objects" : [
		"config/mapObjects/arcaneTower",
		"config/mapObjects/druidsCave",
		"config/mapObjects/huntersCabin",
		"config/mapObjects/kingsMausoleum",
		"config/mapObjects/tribalTotem",
		"config/mapObjects/treasurePile",
		"config/mapObjects/treasurePile2"
	],
	"settings" : {
		"modules" : {
			"stackArtifact" : true
		}
	},
	"skills" : [
		"config/skills/arcana",
		"config/skills/battle-fury",
		"config/skills/benevolence",
		"config/skills/bladeBane",
		"config/skills/championTraining",
		"config/skills/channeling",
		"config/skills/defender",
		"config/skills/electromancy",
		"config/skills/eliteTraining",
		"config/skills/enchantWeapons",
		"config/skills/evasion",
		"config/skills/gathering",
		"config/skills/infantryCommander",
		"config/skills/infliction",
		"config/skills/inspiration",
		"config/skills/irresistibleMagic",
		"config/skills/manaReserves",
		"config/skills/mentor",
		"config/skills/mindMagic",
		"config/skills/occultism",
		"config/skills/recruitment",
		"config/skills/skyMaster",
		"config/skills/stormwind",
		"config/skills/suppression",
		"config/skills/swiftness",
		"config/skills/vitality"
	],
	"spells" : [
		"config/spells/blocked/summonEnchanters",
		"config/spells/blocked/instantLightning",
		"config/spells/blocked/swiftStriker",
		"config/spells/unlockable/empower",
		"config/spells/unlockable/lightningStorm",
		"config/spells/unlockable/regeneration",
		"config/spells/unlockable/wither"
	]
}
